{
  "projects": [
    {
      "id": 1,
      "title": "CretChain",
      "description": "CretChain is a decentralized platform designed to enhance digital asset security, transparency, and efficiency using blockchain technology. It provides seamless solutions for asset management, smart contracts, and secure transactions.",
      "image": "/images/certchain.png",
      "previewImage": "/images/certchain.png",
      "role": "Full Stack Developer",
      "teamSize": "4 members",
      "technologies": ["Solidity", "Ethereum", "React", "Node.js", "Web3.js"],
      "completedDate": "March 2025",
      "category": "Blockchain Development",
      "overview": "CretChain is a cutting-edge blockchain-based platform that enables users to manage digital assets securely. It offers decentralized finance (DeFi) solutions, smart contract automation, and enhanced security features to ensure transparent and trustless transactions. My role involved developing both the frontend and backend, ensuring seamless user interaction with the blockchain network.",
      "challenges": [
        {
          "title": "Smart Contract Security",
          "solution": "Implemented rigorous smart contract audits and integrated OpenZeppelin security libraries to prevent vulnerabilities like reentrancy attacks."
        },
        {
          "title": "Blockchain Scalability",
          "solution": "Optimized gas fees and implemented Layer 2 scaling solutions to enhance transaction efficiency and reduce costs."
        }
      ],
      "links": [
        {
          "text": "Live Demo",
          "url": "https://cretchain.co"
        },
        {
          "text": "GitHub Frontend",
          "url": "https://github.com/sukunazz/certchain-appl-main"
        },
        {
          "text": "GitHub Backend",
          "url": "https://github.com/sukunazz/certchain-api-main"
        }
      ],
      "achievements": [
        "Successfully deployed secure smart contracts with zero vulnerabilities",
        "Optimized blockchain transactions, reducing gas fees by 30%",
        "Designed an intuitive UI for seamless DeFi interactions"
      ],
      "gallery": [
        {
          "src": "/images/cretchain-dashboard.png",
          "alt": "CretChain Dashboard"
        },
        {
          "src": "/images/cretchain-transactions.png",
          "alt": "Secure Transactions Feature"
        }
      ],
      "nextProject": {
        "id": 2,
        "title": "Next Blockchain Innovation"
      }
    },
    {
      "id": 2,
      "title": "BookScraper",
      "description": "BookScraper is a web app that scrapes real-time share data, tracks stock prices, and provides automated market insights.",
      "image": "/images/sharesansar.png",
      "previewImage": "/images/sharesansar.png",
      "role": "Full Stack Developer",
      "teamSize": "Solo Project",
      "technologies": ["Python", "BeautifulSoup", "Flask", "Vue.js"],
      "completedDate": "October 2024",
      "category": "Data Science",
      "overview": "BookScraper is an automated data analysis tool that extracts real-time information from financial websites, processes the data, and presents actionable insights to users. The application tracks stock prices, analyzes market trends, and generates reports to help investors make informed decisions. As the sole developer, I handled everything from data extraction and backend processing to frontend visualization.",
      "challenges": [
        {
          "title": "Data Accuracy and Reliability",
          "solution": "Implemented robust error handling and data validation techniques, along with multiple source verification to ensure data accuracy even when primary sources were unavailable."
        },
        {
          "title": "Processing Large Datasets",
          "solution": "Used asyncio in Python for concurrent processing and implemented efficient data storage with SQLite for local caching, significantly reducing processing time for large datasets."
        }
      ],
      "links": [
        {
          "text": "Project Demo",
          "url": "https://bookscraper-demo.herokuapp.com"
        },
        {
          "text": "Source Code",
          "url": "https://github.com/username/bookscraper"
        }
      ],
      "achievements": [
        "Processed over 10,000 data points daily with 99.8% accuracy",
        "Reduced manual analysis time by 85% for financial advisors using the platform",
        "Featured in a local tech publication for innovative use of web scraping technology"
      ],

      "nextProject": {
        "id": 4,
        "title": "WoodCraft"
      }
    },
    {
      "id": 4,
      "title": "WoodCraft",
      "description": "WoodCraft is a comprehensive e-commerce platform that enables users to purchase a wide variety of goods online with secure payment processing, inventory management, and seamless user experience.",
      "image": "/images/woodcraft.png",
      "previewImage": "/images/woodcraft.png",
      "role": "Full Stack Developer",
      "teamSize": "3 members",
      "technologies": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Stripe API",
        "Redux"
      ],
      "completedDate": "June 2025",
      "category": "E-Commerce Development",
      "overview": "WoodCraft is a modern e-commerce platform designed to provide users with a seamless online shopping experience. The platform features product browsing, advanced search functionality, shopping cart management, secure checkout, order tracking, and admin dashboard for inventory management. Built with a focus on user experience and scalability, it supports multiple payment methods and real-time inventory updates.",
      "challenges": [
        {
          "title": "Payment Security and Integration",
          "solution": "Integrated Stripe payment gateway with robust security measures including SSL encryption, tokenization, and PCI DSS compliance to ensure secure transactions."
        },
        {
          "title": "Real-time Inventory Management",
          "solution": "Implemented WebSocket connections and MongoDB change streams to provide real-time inventory updates, preventing overselling and maintaining accurate stock levels."
        },
        {
          "title": "Scalable Architecture",
          "solution": "Designed a microservices architecture with separate services for user management, product catalog, orders, and payments, ensuring the platform can handle high traffic loads."
        }
      ],
      "links": [
        {
          "text": "GitHub Frontend",
          "url": "https://github.com/sukunazz/ecommerce-frontend"
        },
        {
          "text": "GitHub Backend",
          "url": "https://github.com/sukunazz/ecommerce-backend"
        }
      ],
      "achievements": [
        "Successfully processed over 5,000 orders with 99.9% payment success rate",
        "Implemented advanced search and filtering system with sub-second response times",
        "Built responsive design that increased mobile conversion rates by 40%",
        "Integrated automated email notifications for order confirmations and shipping updates"
      ],
      "gallery": [
        {
          "src": "/images/woodcraft-homepage.png",
          "alt": "WoodCraft Homepage"
        },
        {
          "src": "/images/woodcraft-products.png",
          "alt": "Product Catalog Page"
        },
        {
          "src": "/images/woodcraft-checkout.png",
          "alt": "Secure Checkout Process"
        },
        {
          "src": "/images/woodcraft-dashboard.png",
          "alt": "Admin Dashboard"
        }
      ],
      "nextProject": {
        "id": 5,
        "title": "StudyWebsite"
      }
    },
    {
      "id": 5,
      "title": "StudyWebsite",
      "description": "StudyWebsite is an educational platform that allows students from different faculties to access study materials, search for questions and subjects, and collaborate in their learning journey with personalized content and interactive features.",
      "image": "/images/studywebsite.png",
      "previewImage": "/images/studywebsite.png",
      "role": "Full Stack Developer",
      "teamSize": "1 member",
      "technologies": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Elasticsearch",
        "Socket.io",
        "JWT"
      ],
      "completedDate": "April 2025",
      "category": "Educational Technology",
      "overview": "StudyWebsite is a comprehensive educational platform designed to serve students across multiple faculties and disciplines. The platform features advanced search capabilities for questions and subjects, personalized study recommendations, interactive discussion forums, progress tracking, and faculty-specific content organization. Students can create study groups, share resources, and access curated materials tailored to their academic programs.",
      "challenges": [
        {
          "title": "Advanced Search and Content Discovery",
          "solution": "Implemented Elasticsearch with custom analyzers and filters to enable semantic search across subjects, questions, and study materials, supporting multiple languages and academic terminologies."
        },
        {
          "title": "Multi-Faculty Content Organization",
          "solution": "Designed a flexible taxonomy system with hierarchical categories, tags, and cross-references to organize content across different faculties while maintaining easy navigation and discovery."
        },
        {
          "title": "Real-time Collaboration Features",
          "solution": "Integrated Socket.io for real-time study group discussions, live Q&A sessions, and collaborative document editing, ensuring seamless interaction between students."
        }
      ],
      "links": [
        {
          "text": "Live Platform",
          "url": "https://studywebsite-platform.com"
        },
        {
          "text": "GitHub Repository",
          "url": "https://github.com/username/studywebsite"
        },
        {
          "text": "Student Guide",
          "url": "https://docs.studywebsite-platform.com/student-guide"
        }
      ],
      "achievements": [
        "Served over 15,000 students across 25+ faculties with 95% user satisfaction",
        "Built intelligent search system with 90% accuracy in content matching",
        "Implemented personalized learning paths that improved study efficiency by 60%",
        "Created collaborative features used by 500+ active study groups daily"
      ],
      "gallery": [
        {
          "src": "/images/studywebsite-dashboard.png",
          "alt": "Student Dashboard"
        },

        {
          "src": "/images/studywebsite-subjects.png",
          "alt": "Subject Organization by Faculty"
        },
        {
          "src": "/images/studywebsite-collaboration.png",
          "alt": "Study Group Collaboration"
        }
      ],
      "nextProject": {
        "id": 5,
        "title": "StudyWebsite"
      }
    }
  ]
}
